##############################################멀티 / 123차원
# royal 아파트에 4개층 4개호 이다.
royal = [[],[],[],[]]
# 한번에 한층을 밀어 넣기
royal[0] = ['0층0호','0층1호','0층2호','0층3호']
royal[1] = ['1층0호','1층1호','1층2호','1층3호']

royal[2] = [
    ['2층0호0번방','2층0호1번방','2층0호2번방'],
    ['2층1호0번방','2층1호1번방','2층1호2번방'],
    ['2층2호0번방','2층2호1번방','2층2호2번방'],
    ['2층3호0번방','2층3호1번방','2층3호2번방'],
]

royal[3] = [
    ['3층0호0번방','3층0호1번방','3층0호2번방'],
    ['3층1호0번방','3층1호1번방','3층1호2번방'],
    ['3층2호0번방','3층2호1번방','3층2호2번방'],
    ['3층3호0번방','3층3호1번방','3층3호2번방'],
]
print(royal)
print(royal[3])
print(royal[3][3])
print(royal[3][3][2])


# 슬라이싱은 특정 영역만큼 선택해서 보여주거나, 값을 추가하는 방법.
a = ['life','is','too','short']
b = a[1:3]
print(b)

